# ── Shell & Terminal ──────────────────────────────────────────────────────────
brew "zsh"
brew "starship"
brew "tmux"
cask "wezterm"

# ── Python Ecosystem ──────────────────────────────────────────────────────────
brew "pyenv"
brew "uv"
brew "pipx"
cask "miniforge"

# ── Data & ML Tools ───────────────────────────────────────────────────────────
brew "duckdb"
brew "jq"
brew "yq"

# ── Development Tools ─────────────────────────────────────────────────────────
brew "git"
brew "git-lfs"
brew "gh"
brew "pre-commit"
brew "act"
cask "docker-desktop"

# ── Code Quality ──────────────────────────────────────────────────────────────
brew "ruff"

# ── AI / LLM Tooling ─────────────────────────────────────────────────────────
brew "ollama"
brew "node"           # required for Claude Code MCP servers

# ── Cloud & Infra ─────────────────────────────────────────────────────────────
brew "awscli"
cask "google-cloud-sdk"
brew "terraform"
brew "kubectl"
brew "helm"
brew "k9s"

# ── Terminal Utilities ────────────────────────────────────────────────────────
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "delta"
brew "htop"
brew "btop"
brew "hyperfine"
brew "watch"
brew "wget"
brew "curl"
brew "tree"

# ── Editors ───────────────────────────────────────────────────────────────────
brew "neovim"
cask "visual-studio-code"
cask "cursor"

# ── Productivity ──────────────────────────────────────────────────────────────
cask "raycast"
cask "1password"
cask "1password-cli"
cask "rectangle"
